# a=int(input('a:'))
# b=int(input('b:'))
# c=int(input('c:'))
# count=0
# if a==b:
#     count+=1
# if b==c:
#     count+=1
# if a==c:
#     count+=1
# print(count)
# также вводим 4 координаты и смотрим : сможет ли походить ферзь 
# x0=7
# y0=5
# x1=4
# y1=2
# if x0==x1 or y0==y1 or abs(x1-x0)==abs(y0-y1) or abs(x1+x0)==abs(y0+y1):
#     print('ok')
# else:
#     print('ne ok')
# двумя способами вывести первые n элементов массива 
# l=[1,5236,6,7,-9,0,1]
# n=int(input('n:'))
# # 1 способ 
# for i in range(n):
#     print(l[i])
# # 2 способ 
# print(l[:n:])
# tup=(326,215,769)
# tup.
# d={'имя':'Миша','возраст':[5,100]}
# d['почта']='m@y.ru'
# print(d['почта'])
# задача :написать номер дома 
# d={'город':
#    'Питер','адрес':{'улица':'садовая','дом':23}}
